[
  {
    "productId": 1,
    "productName": "Hot Wheels Track Set",
    "sellerName": "Speedy Toys",
    "sellerEmail": "support@speedytoys.com",
    "price": 34.99,
    "rating": 4.5,
    "availableQuantity": 120,
    "description": "An exciting Hot Wheels track set featuring loops, ramps, and sharp turns, designed for thrill-seeking kids who love speed and racing. This set allows children to design and customize their own tracks, testing the limits of their imagination while improving problem-solving skills. Perfect for competitive racing with friends or solo creative play, it promotes teamwork, fine motor skills, and hand-eye coordination. Durable and safe for endless hours of fun, this set is ideal for children aged 5 and above.",
    "pictureURL": "https://www.pngall.com/wp-content/uploads/11/Hot-Wheels-Car-PNG-Image-HD.png",
    "subCategory": "Vehicle Toys"
  },
  {
    "productId": 2,
    "productName": "Lego Classic Bricks",
    "sellerName": "Toys R Us Local",
    "sellerEmail": "contact@toysruslocal.com",
    "price": 49.99,
    "rating": 4.7,
    "availableQuantity": 75,
    "description": "A timeless set of colorful Lego bricks designed to spark imagination, creativity, and problem-solving skills in children of all ages. With hundreds of pieces in a variety of shapes and colors, kids can construct anything they dream of—from houses, vehicles, and spaceships to entirely unique creations. This set encourages both solo play and collaborative building, helping develop fine motor skills, spatial awareness, and planning. Perfect for inspiring storytelling, hands-on learning, and endless hours of constructive fun. Suitable for children aged 4 and above.",
    "pictureURL": "https://www.lego.com/cdn/cs/set/assets/bltbcfcf384c7e75fd6/10713_Prod.png?fit=crop&quality=80&width=400&height=400&dpr=1",
    "subCategory": "Building Blocks"
  },
  {
    "productId": 3,
    "productName": "Barbie Dreamhouse",
    "sellerName": "Fashion Toys Co.",
    "sellerEmail": "info@fashiontoys.com",
    "price": 129.99,
    "rating": 4.8,
    "availableQuantity": 40,
    "description": "A luxurious Barbie Dreamhouse with multiple rooms, fully furnished accessories, and interactive elements to inspire hours of imaginative play. Children can host parties, organize adventures, and create intricate stories using Barbie dolls. This set fosters creativity, storytelling, and social skills as kids play individually or with friends. With a focus on detailed design and realistic features, it encourages children to explore different roles, problem-solving, and imaginative worlds. Suitable for ages 6 and above, it’s a perfect gift for any Barbie fan.",
    "pictureURL": "https://i.pinimg.com/originals/e0/3a/1f/e03a1f1c1d37f83db78bcb4ee9b31b99.png",
    "subCategory": "Dolls"
  },
  {
    "productId": 4,
    "productName": "Play-Doh Mega Pack",
    "sellerName": "Creative Kids Store",
    "sellerEmail": "sales@creativekids.com",
    "price": 24.99,
    "rating": 4.6,
    "availableQuantity": 150,
    "description": "A massive Play-Doh set with vibrant colors and versatile molding tools to inspire creativity and artistic expression. Children can sculpt animals, shapes, buildings, and imaginative creations, helping to develop fine motor skills and hand-eye coordination. This set encourages open-ended play, role-playing scenarios, and collaborative activities. Ideal for crafting, sensory exploration, and classroom activities, it provides endless opportunities for educational fun. Safe, non-toxic, and suitable for children aged 3 and above.",
    "pictureURL": "https://giftidea.com/cdn/shop/products/play-doh-kitchen-cook-n-colors-refill-variety-pack.png?v=1676641961&width=1946",
    "subCategory": "Arts & Crafts"
  },
  {
    "productId": 5,
    "productName": "Fisher-Price Learning Tablet",
    "sellerName": "Smart Toys",
    "sellerEmail": "contact@smarttoys.com",
    "price": 39.99,
    "rating": 4.4,
    "availableQuantity": 85,
    "description": "An interactive learning tablet packed with educational games, songs, stories, and activities designed for toddlers. It helps develop early literacy, numeracy, and problem-solving skills while keeping children engaged for hours. The tablet features touch-sensitive buttons, fun animations, and interactive challenges that promote motor skills, hand-eye coordination, and cognitive growth. Perfect for parents seeking educational yet entertaining tools, it encourages independent learning and screen-based exploration in a safe and age-appropriate way.",
    "pictureURL": "https://i5.walmartimages.com/seo/Fisher-Price-Laugh-Learn-Smart-Stages-Tablet-Toddler-Electronic-Musical-Learning-Toy_5a93f634-ce35-4223-99b4-66ccfb39041e.d010eea9f1b2b1111819661637a453bd.jpeg",
    "subCategory": "Educational"
  },
  {
    "productId": 6,
    "productName": "Nerf Elite Blaster",
    "sellerName": "Action Toys",
    "sellerEmail": "support@actiontoys.com",
    "price": 29.99,
    "rating": 4.5,
    "availableQuantity": 60,
    "description": "A high-performance Nerf blaster that fires soft foam darts with speed and accuracy. Perfect for indoor and outdoor action-packed battles, this toy promotes physical activity, strategic thinking, and hand-eye coordination. Ideal for group play or solo practice, it encourages social interaction, teamwork, and friendly competition. The durable design ensures long-lasting fun, making it suitable for children aged 6 and above. Safe, non-toxic darts provide hours of excitement while keeping play worry-free.",
    "pictureURL": "https://png.pngtree.com/png-clipart/20230409/original/pngtree-best-nerf-blaster-plastic-automatic-soft-bullet-gun-darts-kids-toys-png-image_9041006.png",
    "subCategory": "Action Toys"
  },
  {
    "productId": 7,
    "productName": "Rubik's Cube",
    "sellerName": "Puzzle World",
    "sellerEmail": "info@puzzleworld.com",
    "price": 14.99,
    "rating": 4.7,
    "availableQuantity": 200,
    "description": "The classic 3x3 Rubik's Cube puzzle that challenges the mind and enhances problem-solving skills. Suitable for children and adults, it encourages spatial reasoning, pattern recognition, and patience. This timeless puzzle provides hours of entertainment while improving memory, concentration, and logical thinking. Ideal for solo play or competitive solving, it’s a fantastic way to develop cognitive skills and engage in educational fun.",
    "pictureURL": "https://upload.wikimedia.org/wikipedia/commons/3/30/Rubik_cube.png",
    "subCategory": "Puzzles"
  },
  {
    "productId": 8,
    "productName": "Remote Control Car",
    "sellerName": "Speedy Toys",
    "sellerEmail": "support@speedytoys.com",
    "price": 59.99,
    "rating": 4.6,
    "availableQuantity": 50,
    "description": "A high-speed remote control car with rechargeable battery, responsive controls, and durable construction. Kids can race across different terrains, perform stunts, and practice driving skills. Encourages outdoor play, hand-eye coordination, and quick reflexes. Ideal for competitive racing with friends or solo fun, it provides hours of excitement and encourages problem-solving as kids navigate obstacles. Suitable for ages 5 and above.",
    "pictureURL": "https://atlas-content-cdn.pixelsquid.com/stock-images/rc-car-chassis-radio-controlled-7GYQOGD-600.jpg",
    "subCategory": "Vehicle Toys"
  },
  {
    "productId": 9,
    "productName": "Crayola Art Set",
    "sellerName": "Creative Kids Store",
    "sellerEmail": "sales@creativekids.com",
    "price": 19.99,
    "rating": 4.6,
    "availableQuantity": 90,
    "description": "A complete Crayola art set including crayons, markers, colored pencils, and coloring sheets. Perfect for children who love drawing, coloring, and creating masterpieces. Encourages artistic expression, imagination, and fine motor development. Suitable for solo projects or collaborative activities, it promotes creativity and problem-solving while providing endless hours of colorful fun. Ideal for kids aged 3 and above.",
    "pictureURL": "https://rokbucket.rokomari.io/ProductNew20190903/260X372/Crayola_Creativity_Tub-Crayola-13475-451897.png",
    "subCategory": "Arts & Crafts"
  },
  {
    "productId": 10,
    "productName": "Mega Bloks Construction Set",
    "sellerName": "Building Fun",
    "sellerEmail": "info@buildingfun.com",
    "price": 44.99,
    "rating": 4.5,
    "availableQuantity": 70,
    "description": "A colorful Mega Bloks construction set that allows children to build, stack, and create imaginative structures. Enhances fine motor skills, spatial awareness, and creativity. Perfect for collaborative play, role-playing, and problem-solving exercises. Encourages kids to explore their engineering abilities while having fun building towers, bridges, and unique designs. Suitable for children aged 3 and above, providing hours of constructive entertainment.",
    "pictureURL": "https://res.cloudinary.com/pangea-prod/image/upload/w_620,c_limit,q_auto:good/v1600821980/production/aXRlbV92YXJpYW50/Nzo4ODc5NjE4MDkzMzY6aW1hZ2U6ZW4tQ0E6cHJpbWFyeQ.png",
    "subCategory": "Building Blocks"
  },
  {
    "productId": 11,
    "productName": "Stuffed Teddy Bear",
    "sellerName": "Cuddly Toys",
    "sellerEmail": "support@cuddlytoys.com",
    "price": 22.99,
    "rating": 4.8,
    "availableQuantity": 110,
    "description": "A soft and cuddly teddy bear designed to provide comfort, companionship, and emotional support. Perfect for bedtime snuggles, playtime adventures, or as a thoughtful gift. Encourages imaginative play, nurturing behavior, and social skills. Made from high-quality, hypoallergenic materials to ensure safety and durability. Suitable for children of all ages, it provides a comforting presence and endless hours of companionship.",
    "pictureURL": "https://png.pngtree.com/png-vector/20230928/ourmid/pngtree-cute-bear-teddy-toy-png-image_10149481.png",
    "subCategory": "Stuffed Animals"
  },
  {
    "productId": 12,
    "productName": "LEGO Technic Racer",
    "sellerName": "Toys R Us Local",
    "sellerEmail": "contact@toysruslocal.com",
    "price": 89.99,
    "rating": 4.7,
    "availableQuantity": 35,
    "description": "A LEGO Technic racing car set that challenges older children to build complex and realistic vehicles. Encourages critical thinking, patience, and fine motor development. Features moving parts, realistic mechanisms, and detailed design for a rewarding building experience. Promotes STEM learning, problem-solving, and creativity while providing hours of engaging play. Suitable for ages 9 and above.",
    "pictureURL": "https://atlas-content-cdn.pixelsquid.com/stock-images/lego-race-car-vehicle-ZeYQMrD-600.jpg",
    "subCategory": "Building Blocks"
  },
  {
    "productId": 13,
    "productName": "Interactive Robot Dog",
    "sellerName": "Smart Toys",
    "sellerEmail": "contact@smarttoys.com",
    "price": 79.99,
    "rating": 4.5,
    "availableQuantity": 45,
    "description": "A smart robotic dog that responds to touch, voice commands, and programmed tricks. Encourages interactive play, responsibility, and creativity. Children can train, play, and bond with their robot companion, developing social and cognitive skills. The robot dog features lights, sounds, and movements that simulate real pet behavior, providing a fun and engaging learning experience. Suitable for kids aged 6 and above.",
    "pictureURL": "https://png.pngtree.com/png-clipart/20250502/original/pngtree-a-cute-robotic-dog-with-large-colorful-eyes-heart-shaped-light-png-image_20932829.png",
    "subCategory": "Electronic Toys"
  },
  {
    "productId": 14,
    "productName": "Magic Kit for Kids",
    "sellerName": "Fun & Learn",
    "sellerEmail": "info@funlearn.com",
    "price": 29.99,
    "rating": 4.6,
    "availableQuantity": 65,
    "description": "A comprehensive magic kit with props, tricks, and step-by-step instructions for aspiring young magicians. Encourages creativity, confidence, and performance skills. Children can entertain friends and family, develop public speaking, hand-eye coordination, and problem-solving skills. Provides hours of imaginative fun and teaches the principles of illusion in a safe and age-appropriate way. Suitable for children aged 5 and above.",
    "pictureURL": "https://magicallymekit.com/cdn/shop/files/MagicallyMeKit-Children_sMagicBoxandSELlearningApp_e99b5ea8-889a-4145-bd26-1598a00f547a.png?v=1752951577",
    "subCategory": "Educational"
  },
  {
    "productId": 15,
    "productName": "Glow in the Dark Stars",
    "sellerName": "Creative Kids Store",
    "sellerEmail": "sales@creativekids.com",
    "price": 9.99,
    "rating": 4.3,
    "availableQuantity": 150,
    "description": "Decorative glow-in-the-dark stars that bring a magical night-sky effect to bedrooms. Perfect for children interested in astronomy, space, and imaginative storytelling. Encourages creativity, curiosity, and learning about constellations. Easy to apply and remove without damage, these stars provide a soothing environment for bedtime and fun interactive play during the day. Suitable for all ages.",
    "pictureURL": "https://png.pngtree.com/png-clipart/20210530/ourmid/pngtree-neon-light-flash-stars-png-image_3390102.jpg",
    "subCategory": "Educational"
  },
  {
    "productId": 16,
    "productName": "Puzzle Board Game",
    "sellerName": "Puzzle World",
    "sellerEmail": "info@puzzleworld.com",
    "price": 19.99,
    "rating": 4.5,
    "availableQuantity": 95,
    "description": "A challenging board game puzzle set that stimulates strategic thinking, problem-solving, and teamwork. Perfect for family game nights, friendly competition, or solo play. Encourages patience, logical reasoning, and critical thinking while providing engaging entertainment. Suitable for children aged 6 and above, this puzzle promotes social interaction, mental agility, and fun-filled learning experiences.",
    "pictureURL": "https://png.pngtree.com/png-vector/20230808/ourmid/pngtree-board-game-clipart-board-game-with-children-s-toys-on-it-vector-png-image_6861167.png",
    "subCategory": "Puzzles"
  }
]
